from .autofilterPM import pm_filters
from .autofilterGP import group_filters

autofilter_text = """
𝙼𝙾𝙳𝚄𝙻𝙴 : 🅰︎🆄︎🆃︎🅾︎🅵︎🅸︎🅻︎🆃︎🅴︎🆁︎

 • 𝙸 𝙲𝙰𝙽 𝙿𝚁𝙾𝚅𝙸𝙳𝙴 𝙵𝙸𝙻𝙴𝚂 𝙸𝙽 𝚈𝙾𝚄𝚁 𝙶𝚁𝙾𝚄𝙿, 𝙸𝚃 𝚅𝙴𝚁𝚈 𝙴𝙰𝚂𝚈 𝚆𝙰𝚈 𝙹𝚄𝚂𝚃 𝙰𝙳𝙳 𝙼𝙴 𝚃𝙾 𝚈𝙾𝚄𝚁 𝙶𝚁𝙾𝚄𝙿 𝙰𝙽𝙳 𝙼𝙰𝙺𝙴 𝙼𝙴 𝙰𝙳𝙼𝙸𝙽 𝚈𝙾𝚄𝚁 𝙶𝚁𝙾𝚄𝙿, 𝚃𝙷𝙰𝚃𝚂 𝙰𝙻𝙻.. 𝙸 𝚆𝙸𝙻𝙻 𝙿𝚁𝙾𝚅𝙸𝙳𝙴 𝙵𝙸𝙻𝙴𝚂 𝙵𝚁𝙾𝙼 𝚈𝙾𝚄𝚁 𝙶𝚁𝙾𝚄𝙿

📚 🅲︎🅾︎🅼︎🅼︎🅰︎🅽︎🅳︎ :-

 • 𝚄𝚂𝙴 𝚃𝙷𝙴 /settings 𝙲𝙾𝙼𝙼𝙰𝙽𝙳 𝚃𝙾 𝙼𝙾𝙳𝙸𝙵𝚈 𝙰𝚄𝚃𝙾𝙵𝙸𝙻𝚃𝙴𝚁 𝚂𝙴𝚃𝚃𝙸𝙽𝙶𝚂
 • 𝚄𝚂𝙴 𝚃𝙷𝙴 /pmautofilter 𝚃𝙾 𝚃𝚄𝚁𝙽 𝙾𝙵𝙵/𝙾𝙽 𝙿𝙼 𝙰𝚄𝚃𝙾𝙵𝙸𝙻𝚃𝙴𝚁

🧩 🅵︎🅾︎🆁︎🅼︎🅰︎🆃︎ :-

› /set_temp : 𝚂𝙴𝚃 𝚁𝙴𝚀𝚄𝙴𝚂𝚃 𝚃𝙴𝚇𝚃 

 • `{mention}` : 𝙽𝙰𝙼𝙴 & 𝚄𝚂𝙴𝚁 𝙿𝚁𝙾𝙵𝙸𝙻𝙴 𝙻𝙸𝙽𝙺
 • `{query}` : 𝚁𝙴𝚀𝚄𝙴𝚂𝚃 𝚃𝙴𝚇𝚃
 • `{group_name}` : 𝙶𝙴𝚃 𝙲𝙷𝙰𝚃 𝙽𝙰𝙼𝙴

› 𝙴𝙶 : `/set_temp {query}`
"""

connection_text = """
𝙼𝙾𝙳𝚄𝙻𝙴 : 🅲︎🅾︎🅽︎🅽︎🅴︎🅲︎🆃︎🅸︎🅾︎🅽︎🆂︎ :-

 • 𝚈𝙾𝚄 𝙲𝙰𝙽 𝙼𝙾𝙳𝙸𝙵𝚈 𝙰𝚄𝚃𝙾𝙵𝙸𝙻𝚃𝙴𝚁 𝚂𝙴𝚃𝚃𝙸𝙽𝙶𝚂 𝙵𝚁𝙾𝙼 𝙿𝙼 𝙰𝙵𝚃𝙴𝚁 𝙲𝙾𝙽𝙽𝙴𝙲𝚃𝙸𝙳𝙽𝙶

📚 🅲︎🅾︎🅼︎🅼︎🅰︎🅽︎🅳︎🆂︎ :-

 • /connect : 𝙲𝚁𝙴𝙰𝚃𝙴 𝙰 𝙽𝙴𝚆 𝙲𝙾𝙽𝙽𝙴𝙲𝚃
 • /disconnect : 𝙳𝙴𝙻𝙴𝚃𝙴 𝙰𝙽𝚈 𝙴𝚇𝙸𝚂𝚃𝙸𝙽𝙶 𝙲𝙾𝙽𝙽𝙴𝙲𝚃𝙸𝙾𝙽
 • /connections : 𝙶𝙴𝚃 𝙲𝙾𝙽𝙽𝙴𝙲𝚃𝙸𝙾𝙽𝚂 𝙻𝙸𝚂𝚃"""


spellcheck_text = """
𝙼𝙾𝙳𝚄𝙻𝙴 : 🆂︎🅿︎🅴︎🅻︎🅻︎🅲︎🅷︎🅴︎🅲︎🅺︎ :-

 • 𝙴𝚅𝙴𝚁𝚈𝚃𝙷𝙸𝙽𝙶 𝚁𝙴𝙻𝙰𝚃𝙴𝙳 𝚃𝙾 𝚃𝙷𝙴 𝚂𝙿𝙴𝙻𝙻 𝙲𝙷𝙴𝙲𝙺 𝙼𝙾𝙳𝚄𝙻𝚆 𝚆𝙷𝙴𝙽 𝙽𝙾 𝙰𝚄𝚃𝙾𝙵𝙸𝙻𝚃𝙴𝚁 𝚁𝙴𝚂𝚄𝙻𝚃𝚂 𝙰𝚁𝙴 𝙵𝙾𝚄𝙽𝙳

📚 🅲︎🅾︎🅼︎🅼︎🅰︎🅽︎🅳︎ :-

 • 𝚂𝙴𝚃 𝙰 𝙽𝙴𝚆 𝚂𝙿𝙴𝙻𝙻𝙲𝙷𝙴𝙲𝙺 𝚃𝙴𝚇𝚃 𝚄𝚂𝙴 𝚃𝙷𝙸𝚂 𝙲𝙾𝙼𝙼𝙼𝙰𝙽𝙳 /setspell

🧩 🅵︎🅾︎🆁︎🅼︎🅰︎🆃︎ :-

› /setspell : 𝚂𝙴𝚃 𝚂𝙿𝙴𝙻𝙻 𝙲𝙷𝙴𝙲𝙺 𝙼𝙴𝚂𝚂𝙰𝙶𝙴

 • `{mention}` : 𝙽𝙰𝙼𝙴 & 𝚄𝚂𝙴𝚁 𝙿𝚁𝙾𝙵𝙸𝙻𝙴 𝙻𝙸𝙽𝙺
 • `{query}` : 𝚁𝙴𝚀𝚄𝙴𝚂𝚃 𝚃𝙴𝚇𝚃
 • `{first_name}` : 𝙵𝙸𝚁𝚂𝚃 𝙽𝙰𝙼𝙴
 • `{last_name}` : 𝙻𝙰𝚂𝚃 𝙽𝙰𝙼𝙴
 • `{title}` : 𝙶𝙴𝚃 𝙲𝙷𝙰𝚃 𝙽𝙰𝙼𝙴

› 𝙴𝙶 : `/setspell Check Your Spelling {query}`"""

welcome_text = """
𝙼𝙾𝙳𝚄𝙻𝙴 : 🆆︎🅴︎🅻︎🅲︎🅾︎🅼︎🅴︎ :-

 • 𝚃𝙷𝙸𝚂 𝙸𝚂 𝚃𝙷𝙴 𝙼𝙴𝚂𝚂𝙰𝙶𝙴 𝚃𝙷𝙰𝚃 𝙲𝙾𝙼𝙴𝚂 𝚆𝙷𝙴𝙽 𝙰 𝙽𝙴𝚆𝚄𝚂𝙴𝚁 𝙲𝙾𝙼𝙴𝚂 𝚃𝙾 𝚈𝙾𝚄𝚁 𝙶𝚁𝙾𝚄𝙿

📚 🅲︎🅾︎🅼︎🅼︎🅰︎🅽︎🅳︎ :-

 • 𝚂𝙴𝚃 𝙰 𝙽𝙴𝚆 𝚆𝙴𝙻𝙲𝙾𝙼𝙴 𝙼𝙴𝚂𝚂𝙰𝙶𝙴 𝚄𝚂𝙴 𝚃𝙷𝙸𝚂 𝙲𝙾𝙼𝙼𝙼𝙰𝙽𝙳 /setwelcome

🧩 🅵︎🅾︎🆁︎🅼︎🅰︎🆃︎ :-

› /setwelcome : 𝚂𝙴𝚃 𝚂𝙿𝙴𝙻𝙻 𝙲𝙷𝙴𝙲𝙺 𝙼𝙴𝚂𝚂𝙰𝙶𝙴

 • `{mention}` : 𝙽𝙰𝙼𝙴 & 𝚄𝚂𝙴𝚁 𝙿𝚁𝙾𝙵𝙸𝙻𝙴 𝙻𝙸𝙽𝙺
 • `{first_name}` : 𝙵𝙸𝚁𝚂𝚃 𝙽𝙰𝙼𝙴
 • `{last_name}` : 𝙻𝙰𝚂𝚃 𝙽𝙰𝙼𝙴
 • `{username}` : 𝚄𝚂𝙴𝚁𝙽𝙰𝙼𝙴
 • `{group_name}` : 𝙲𝙷𝙰𝚃 𝙽𝙰𝙼𝙴

› 𝙴𝙶 : `/setwelcome `Hello {mention}`"""

misc_text = """
𝙼𝙾𝙳𝚄𝙻𝙴 : 🅼︎🅸︎🆂︎🅲︎ :-

 • 𝙰 𝙼𝙾𝙳𝚄𝙻𝙴 𝚃𝙾 𝙵𝙴𝚃𝙲𝙷 𝚃𝙴𝙻𝙴𝙶𝚁𝙰𝙼 𝚄𝚂𝙴𝚁 & 𝙶𝚁𝙾𝚄𝙿 𝙸𝙽𝙵𝙾 

📚 🅲︎🅾︎🅼︎🅼︎🅰︎🅽︎🅳︎ :-

 • /id : 𝙶𝙴𝚃 𝚄𝚂𝙴𝚁 𝙸𝙳
 • /info : 𝙶𝙴𝚃 𝚄𝚂𝙴𝚁 𝙸𝙽𝙵𝙾"""

filecaption_text = """
𝙼𝙾𝙳𝚄𝙻𝙴 : 🅵︎🅸︎🅻︎🅴︎🅲︎🅰︎🅿︎🆃︎🅸︎🅾︎🅽︎ :-

 • 𝚄𝚂𝙴 𝚃𝙷𝙸𝚂 𝙵𝙴𝙰𝚃𝚄𝚁𝙴 𝚃𝙾 𝙰𝙳𝙳 𝙰 𝙲𝚄𝚂𝚃𝙾𝙼 𝙲𝙰𝙿𝚃𝙸𝙾𝙽 𝚃𝙾 𝙵𝙸𝙻𝙴𝚂

📚 🅲︎🅾︎🅼︎🅼︎🅰︎🅽︎🅳︎ :-

 • /setcaption : 𝚂𝙴𝚃 𝙽𝙴𝚆 𝙵𝙸𝙻𝙴 𝙲𝙰𝙿𝚃𝙸𝙾𝙽

🧩 🅵︎🅾︎🆁︎🅼︎🅰︎🆃︎ :-

› /setcaption : 𝚂𝙴𝚃 𝙵𝙸𝙻𝙴 𝙲𝙰𝙿𝚃𝙸𝙾𝙽 𝙼𝙴𝚂𝚂𝙰𝙶𝙴

 • {mention} : 𝚄𝚂𝙴𝚁 𝙿𝚁𝙾𝙵𝙸𝙻𝙴 
 • {file_name} : 𝙵𝙸𝙻𝙴 𝙽𝙰𝙼𝙴
 • {size} : 𝙵𝙸𝙻𝙴 𝚂𝙸𝚉𝙴
 • {caption} : 𝙶𝙴𝚃 𝙲𝙰𝙿𝚈 𝙲𝙰𝙿𝚃𝙸𝙾𝙽"""
